#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.cloudflare_zone.main_com_domain: Reading...
data.cloudflare_zone.main_com_domain: Read complete after 0s [id=4847e10a43d8cdca2e4554f62f429730]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_page_rule.jbcom_pagerules["new-jb-com"] will be created
  + resource "cloudflare_page_rule" "jbcom_pagerules" {
      + id       = (known after apply)
      + priority = 2
      + status   = "active"
      + target   = "new.elreydetoda.site"
      + zone_id  = "4847e10a43d8cdca2e4554f62f429730"

      + actions {
          + always_use_https    = false
          + disable_apps        = false
          + disable_performance = false
          + disable_railgun     = false
          + disable_security    = false
          + disable_zaraz       = false

          + forwarding_url {
              + status_code = 301
              + url         = "https://www.jupiterbroadcasting.com"
            }
        }
    }

  # cloudflare_page_rule.jbcom_pagerules["www-jb-com"] will be created
  + resource "cloudflare_page_rule" "jbcom_pagerules" {
      + id       = (known after apply)
      + priority = 1
      + status   = "active"
      + target   = "elreydetoda.site"
      + zone_id  = "4847e10a43d8cdca2e4554f62f429730"

      + actions {
          + always_use_https    = false
          + disable_apps        = false
          + disable_performance = false
          + disable_railgun     = false
          + disable_security    = false
          + disable_zaraz       = false

          + forwarding_url {
              + status_code = 301
              + url         = "https://www.jupiterbroadcasting.com"
            }
        }
    }

  # cloudflare_record.jb_com["archive"] will be created
  + resource "cloudflare_record" "jb_com" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "archive"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "AAAA"
      + value           = "2600:3c03::f03c:93ff:fe35:667b"
      + zone_id         = "4847e10a43d8cdca2e4554f62f429730"
    }

  # cloudflare_record.jb_com["colony"] will be created
  + resource "cloudflare_record" "jb_com" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "colony"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "45.79.76.52"
      + zone_id         = "4847e10a43d8cdca2e4554f62f429730"
    }

  # cloudflare_record.jb_com["core"] will be created
  + resource "cloudflare_record" "jb_com" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "core"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "45.79.147.12"
      + zone_id         = "4847e10a43d8cdca2e4554f62f429730"
    }

  # cloudflare_record.jb_com["dev"] will be created
  + resource "cloudflare_record" "jb_com" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "dev"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "AAAA"
      + value           = "2600:3c03::f03c:93ff:fe35:667b"
      + zone_id         = "4847e10a43d8cdca2e4554f62f429730"
    }

  # cloudflare_record.jb_com["donate"] will be created
  + resource "cloudflare_record" "jb_com" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "donate"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "24.16.90.47"
      + zone_id         = "4847e10a43d8cdca2e4554f62f429730"
    }

  # cloudflare_record.jb_com["jbcom"] will be created
  + resource "cloudflare_record" "jb_com" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "45.79.147.12"
      + zone_id         = "4847e10a43d8cdca2e4554f62f429730"
    }

  # cloudflare_record.jb_com["legacy"] will be created
  + resource "cloudflare_record" "jb_com" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "legacy"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "216.66.43.105"
      + zone_id         = "4847e10a43d8cdca2e4554f62f429730"
    }

  # cloudflare_record.jb_com["netdata"] will be created
  + resource "cloudflare_record" "jb_com" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "netdata"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "AAAA"
      + value           = "2600:3c03::f03c:93ff:fe35:667b"
      + zone_id         = "4847e10a43d8cdca2e4554f62f429730"
    }

  # cloudflare_record.jb_com["new"] will be created
  + resource "cloudflare_record" "jb_com" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "new"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "jupiterbroadcasting.com"
      + zone_id         = "4847e10a43d8cdca2e4554f62f429730"
    }

  # cloudflare_record.jb_com["notes"] will be created
  + resource "cloudflare_record" "jb_com" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "notes"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "45.79.147.12"
      + zone_id         = "4847e10a43d8cdca2e4554f62f429730"
    }

  # cloudflare_record.jb_com["status"] will be created
  + resource "cloudflare_record" "jb_com" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "status"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "50.116.37.88"
      + zone_id         = "4847e10a43d8cdca2e4554f62f429730"
    }

  # cloudflare_record.jb_com["test.dev"] will be created
  + resource "cloudflare_record" "jb_com" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "test.dev"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "45.79.206.17"
      + zone_id         = "4847e10a43d8cdca2e4554f62f429730"
    }

  # cloudflare_record.jb_com["www"] will be created
  + resource "cloudflare_record" "jb_com" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "45.79.147.12"
      + zone_id         = "4847e10a43d8cdca2e4554f62f429730"
    }

Plan: 15 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @elreydetoda, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*